import 'package:monews/models/agency.dart';
import 'package:monews/models/news.dart';

var agency = Agnecy("agency.png", "ورزش سه");
var tags = [
  "ورزشی",
  "لژیونر ها",
  "فوتبال اروپا",
];

List<News> hot_news = [
  News(
    1,
    "news_image.png",
    "ورزشی",
    "پــاسـخ منـفـی پــورتـــو بـه چلـسـی بـرای جذب طارمی با طعم تهدید!",
    "باشگاه چلسی که پیگیر جذب مهدی طارمی مهاجـم ایران بـود، با پاسـخ منفی باشگاه پورتو مواجه شد و این بازیـکن باوجود رویای بازی در لیگ برتر انگلیس فعلا در پرتغال ماندنی است.",
    agency,
    tags,
    "۱۰ آذر ۱۴۰۱",
  ),
  News(
    2,
    "news_image.png",
    "ورزشی",
    "پــاسـخ منـفـی پــورتـــو بـه چلـسـی بـرای جذب طارمی با طعم تهدید!",
    "باشگاه چلسی که پیگیر جذب مهدی طارمی مهاجـم ایران بـود، با پاسـخ منفی باشگاه پورتو مواجه شد و این بازیـکن باوجود رویای بازی در لیگ برتر انگلیس فعلا در پرتغال ماندنی است.",
    agency,
    tags,
    "۱۰ آذر ۱۴۰۱",
  ),
];
