import 'package:monews/models/agency.dart';
import 'package:monews/models/news.dart';

String subtitle =
    "شرط بازگشت نیمار: صعود برزیل به فینال! ... تلسکوپ جیمز وب ناسا تصاویر خارق‌العاده‌ای از تیتان، بزرگترین قمر زحل ثبت کرد ... ";

List<News> hot_news = [
  News(
    1,
    "news1.png",
    "ورزشی",
    "هدف اصلی رونالدو: درخشش در قطر و ماندن در اروپا",
    ".شایعات مربوط به پیوستن رونالدو به النصر عربستان در چند روز اخیر از سوی بسیاری از رسانه‌های اروپایی مطرح شد. اولین بار این روزنامه اسپانیایی مارکا بود که اعلام کرد این بازیکن پرتغالی برای پیوستن به این باشگاه با دستمزد سالانه 200 میلیون یورویی به توافق رسیده و پس از پایان جام جهانی 2022 قطر قراردادی رسمی را امضا خواهد کرد. با این حال، روز گذشته سان این موضوع را تکذیب کرد و مدعی شد که هنوز هیچ قراردادی بین این ستاره سابق منچستریونایتد و باشگاه النصر به امضا نرسیده و اولویت او حضور در فوتبال اروپا است. حالا مورگان که مصاحبه او با رونالدو باعث خشم مدیران یونایتد شده و در نهایت منجر به جدایی این بازیکن از این باشگاه شد، مدعی است که رونالدو علاقه زیادی به انتقال به النصر ندارد. او در این باره به روزنامه انگلیسی دیلی تلگراف گفت:« کریستیانو فکر می‌کند که اگر عملکرد خوبی در این جام جهانی داشته باشد، به چیزی که واقعا دوست دارد خواهد رسید. خواسته او این است که بتواند در باشگاهی بازی کند که در لیگ قهرمانان حضور دارد تا رکوردها و میراثش را بهبود ببخشد.»مورگان با اشاره به پیشنهاد هنگفت النصر اضافه کرد:« مسئله در حال حاضر برای او پول نیست. او اشتیاق زیادی برای بازی کردن در بالاترین سطح ممکن، شکستن رکوردها و فتح جام‌ها دارد و این کار را بیشتر از هر بازیکن دیگری انجام داده است.»  ",
    Agency("varzesh3.png", "ورزش سه"),
    ["فوتبال", "کریستیانو رونالدو", "جام جهانی 2022 قطر"],
    "۱۱ آذر ۱۴۰۱",
  ),
  News(
    3,
    "news3.jpg",
    "نجوم و فضا",
    "تصویر روز ناسا: در سیزدهمین روز پرواز چه می‌گذرد؟",
    "فاصله فضاپیمای اوریون از زمین به بیش از ۴۳۰ هزار کیلومتر و از ماه به ۷۰ هزار کیلومتر می‌رسد. در این تصویر از نگاه فضاپیمای بدون خدمه، زمین و ماهواره طبیعی‌‌اش، یعنی ماه، تقریبا هم‌اندازه دیده می‌شوند.امروز ۱ دسامبر باید شاهد خروج اوریون از مدار مخالف دور خود باشیم. دومین پرواز اوریون که با استفاده از نیروی ماه حرکت خواهد کرد، در مسیر رسیدن به سیاره زمین قرار خواهد گرفت. انتظار می‌رود در دسامبر فضاپیمای اوریون به خانه خود برگردد.",
    Agency("digiato.png", "دیجیاتو"),
    ["ناسا", "نجوم"],
    "۱۱ آذر ۱۴۰۱",
  ),
  News(
    4,
    "news4.jpg",
    "بین الملل",
    "بایدن برای گفت‌وگو با پوتین درباره جنگ اوکراین اعلام آمادگی کرد",
    " بایدن در یک نشست خبری مشترک با ماکرون اعلام کرد، آماده گفت‌وگو با پوتین به منظور پایان دادن احتمالی جنگ اوکراین است اما هیچ برنامه فوری برای تماس با او ندارد.به نقل از خبرگزاری تاس، جو بایدن، رئیس جمهوری آمریکا با بیان اینکه به دقت واژه‌ها را برای گفت‌وگو با ولادیمیر پوتین، رئیس جمهوری روسیه انتخاب می‌کند، گفت: حقیقت و مساله این است که من هیچ برنامه فوری برای برقراری تماس با پوتین ندارم.وی ادامه داد: من آماده گفت‌وگو با پوتین هستم، اگر که او هم تصمیم بگیرد تا به دنبال راهی برای پایان دادن به جنگ اوکراین باشد. اما او هنوز این کار را نکرده است. من در رایزنی‌هایم با همتای فرانسوی و دوستان ناتو خوشحال می‌شوم تا پای میز مذاکره با پوتین بنشینم و ببینم در ذهن او چه می‌گذرد.بایدن همچنین ادامه داد: درضمن، فکر می‌کنم آنچه ماکرون گفت، مهم است؛ ما باید از مردم اوکراین حمایت کنیم.",
    Agency("akharinkhabar.png", "آخرین خبر"),
    ["بایدن", "پوتین", "اوکراین"],
    "۱۱ آذر ۱۴۰۱",
  ),
];

List<News> tech_news = [
  News(
    5,
    "news5.jpg",
    "تکنولوژی",
    "نام سیستم عامل هدست واقعیت ترکیبی اپل به xrOS تغییر پیدا کرد",
    "اگر همه چیز طبق برنامه پیش برود، اپل در بهار آینده از هدست واقعیت ترکیبی خود رونمایی خواهد کرد. اکنون در گزارش‌هایی گفته شده که غول کوپرتینویی نام سیستم عامل این دستگاه را به xrOS تغییر داده است که در گزارش‌های قبلی به RealityOS یا rOS اشاره شده بود.مارک گورمن از بلومبرگ گزارش می‌دهد:«به گفته افرادی که خواستند به دلیل در حال توسعه بودن این پروژه نامشان فاش نشود، اپل اخیرا نام سیستم عامل را از realityOS به xrOS تغییر داده است.»گورمن در ادامه توضیح می‌دهد که حروف XR در xrOS مخفف واژه واقعیت توسعه یافته (Extended Reality) است که هم به واقعیت افزوده و هم به واقعیت مجازی مربوط می‌شود. براساس شایعات، هدستی که اپل روی آن کار می‌کند، مانند هولولنز مایکروسافت «واقعیت ترکیبی» خواهد بود، یعنی از قابلیت‌های واقعیت افزوده و مجازی پشتیبانی می‌کند. واقعیت افزوده چیزی که کاربر در دنیای واقعی می‌بیند را تقویت می‌کند، در حالی که واقعیت مجازی یک تجربه کاملاً دیجیتالی است.قابلیت‌های هدست واقعیت ترکیبی اپل هدست اپل این تغییر نام زمانی انجام شده که اپل در حال آماده شدن برای عرضه هدست واقعیت ترکیبی خود است که انتظار می‌رود سال 2023 عرضه شود. دقیقاً مانند سایر محصولات غول فناوری از جمله اپل تی‌وی و اپل واچ، این دستگاه دارای سیستم عامل خاص خود خواهد بود و همچنین یک نسخه اختصاصی از اپ استور برای آن توسعه داده خواهد شد.همانطور که قبلاً نیز گفته شده بود، این هدست دارای نسخه‌های جدیدی از برنامه‌های موجود مانند Maps و Messages خواهد بود که برای تجربه واقعیت مجازی/واقعیت افزوده طراحی شده‌اند. اپل همچنین در حال ایجاد یک کیت توسعه نرم افزار است تا بتوان برنامه‌های شخص ثالث را برای این هدست ایجاد کرد.علاوه بر تایید تغییر نام، در گزارش بلومبرگ همچنین توضیح داده شده که یک شرکت صوری به نام Deep Dive LLC نام xrOS را در چندین کشور ثبت کرده است. اپل اغلب از شرکت‌های صوری استفاده می‌کند تا علامت‌های تجاری محصولات آینده خود را بتواند مخفیانه ثبت کند.",
    Agency("digiato.png", "دیجیاتو"),
    ["اپل"],
    "۱۱ آذر ۱۴۰۱",
  ),
  News(
    2,
    "news2.jpg",
    "تکنولوژی",
    "توییتر تعداد بازدیدهای توییت‌ها را مانند ویدیوها به نمایش می‌گذارد",
    "از زمان تصاحب توییتر توسط ایلان ماسک، تغییرات زیادی در این شبکه اجتماعی رخ داده اما این تمام ماجرا نیست و ظاهراً باید منتظر قابلیت‌های دیگری هم باشیم. مدیرعامل جدید توییتر حالا گفته این شبکه اجتماعی را به قابلیتی مجهز می‌کند تا کاربران راحت‌تر متوجه شوند چه تعداد افراد توییت‌های آن‌ها را خوانده‌اند.ایلان ماسک در توییتر گفته که بسیاری از افراد هر روز از این شبکه اجتماعی استفاده می‌کنند و توییت‌ها را می‌خوانند، اما هرگز توییتی منتشر نمی‌کنند. به همین دلیل از آن‌ها خواسته در گفتگوها شرکت کنند.در واکنش به این گفته ماسک، کاربری گفته که پاسخ‌های زیادی به توییت‌ها می‌دهد، اما هیچ کاربری آن‌‌ها را نمی‌خواند. ثروتمندترین فرد جهان در پاسخ گفته کاربران می‌توانند به تحلیلی از توییت‌های خود دسترسی پیدا کنند و گزینه‌ای برای این‌کار زیر توییت وجود دارد.ماسک همچنین گفته تعداد افرادی که توییت‌ها را می‌خوانند، نسبت به افرادی که به آن‌ها پاسخ می‌دهند، ریتوییت یا لایک می‌کنند، 1000 درصد بیشتر است. بنابراین می‌خواهد چنین موضوعی واضح‌تر در اختیار کاربران قرار بگیرد.مدیرعامل جدید توییتر در توییتی به این موضوع اشاره کرده که این شبکه اجتماعی شروع به نمایش تعداد بازدیدها برای همه توییت‌ها می‌کند، درست مانند قابلیتی که هم‌اکنون برای تمام ویدیوها در دسترس است. این سیستم عملکرد بهتری نسبت به دکمه تحلیل وضعیت توییت کنونی خواهد داشت و حس بهتری را به کاربر منتقل خواهد کرد، البته هنوز نمی‌دانیم این سیستم چه زمانی به توییتر اضافه می‌شود.ایلان ماسک می‌خواهد به باور خودش، آزادی بیان را به توییتر برگرداند و در همین راستا دست به اقدامات مختلفی زده، از جمله بازگرداندن حساب‌های مسدودشده از جمله رئیس جمهور سابق آمریکا، دونالد ترامپ. ظاهراً نمایش تعداد بازدید توییت‌ها هم یکی دیگر از این اقدامات به حساب می‌آید.باید منتظر ماند و دید این اقدامات در نهایت به نفع توییتر تمام می‌شود یا اینکه ایلان ماسک شبکه اجتماعی تحت مالکیتش را به نابودی می‌کشاند.",
    Agency("digiato.png", "دیجیاتو"),
    ["ایلان ماسک", "توییتر"],
    "۱۱ آذر ۱۴۰۱",
  ),
];

List<Agency> agencies = [
  Agency(
    "varzesh3.png",
    "ورزش سه",
  ),
  Agency(
    "digiato.png",
    "دیجیاتو",
  ),
  Agency(
    "akharinkhabar.png",
    "آخرین خبر",
  ),
];
